stm32LLD/timer/src/timer.c
// Copyright (c) 2023 Ziga Miklosic
// All Rights Reserved
////////////////////////////////////////////////////////////////////////////////
/**
*@file      timer.c
*@brief     Timer LL Driver based on STM32 HAL library
*@author    Ziga Miklosic
*@email     ziga.miklosic@gmail.si
*@date      25.04.2023
*@version   V0.1.0
*/
////////////////////////////////////////////////////////////////////////////////
/*!
* @addtogroup TIMER
* @{ <!-- BEGIN GROUP -->
*/
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Includes
////////////////////////////////////////////////////////////////////////////////
#include <stdlib.h>
#include <stdint.h>
#include <stdbool.h>

#include "timer.h"
#include "../../timer_cfg.h"


////////////////////////////////////////////////////////////////////////////////
// Definitions
////////////////////////////////////////////////////////////////////////////////

/**
 *  Timer control
 */
typedef struct
{
    TIM_HandleTypeDef   handle;         /**<UART handler */
    bool                is_init;        /**<Initialization flag */
} timer_ctrl_t;


////////////////////////////////////////////////////////////////////////////////
// Variables
////////////////////////////////////////////////////////////////////////////////

/**
 *  Timer control block
 */
static timer_ctrl_t g_tim_inst[eTIM_INST_NUM_OF] = {0};

////////////////////////////////////////////////////////////////////////////////
// Function prototypes
////////////////////////////////////////////////////////////////////////////////
static void timer_enable_clock  (const TIM_TypeDef * p_inst);
static void timer_disable_clock (const TIM_TypeDef * p_inst);



////////////////////////////////////////////////////////////////////////////////
// Functions
////////////////////////////////////////////////////////////////////////////////


////////////////////////////////////////////////////////////////////////////////
/*!
* @brief        Enable Timer clock
*
* @param[in]    p_inst  - Timer instance
* @return       status  - Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
static void timer_enable_clock(const TIM_TypeDef * p_inst)
{
#if defined(TIM1)
    if ( TIM1 == p_inst )
    {
        __HAL_RCC_TIM1_CLK_ENABLE();
    }
#endif

#if defined(TIM2)
    if ( TIM2 == p_inst )
    {
        __HAL_RCC_TIM2_CLK_ENABLE();
    }
#endif

#if defined(TIM3)
    if ( TIM3 == p_inst )
    {
        __HAL_RCC_TIM3_CLK_ENABLE();
    }
#endif

#if defined(TIM4)
    if ( TIM4 == p_inst )
    {
        __HAL_RCC_TIM4_CLK_ENABLE();
    }
#endif

#if defined(TIM5)
    if ( TIM5 == p_inst )
    {
        __HAL_RCC_TIM5_CLK_ENABLE();
    }
#endif

#if defined(TIM6)
    if ( TIM6 == p_inst )
    {
        __HAL_RCC_TIM6_CLK_ENABLE();
    }
#endif

#if defined(TIM7)
    if ( TIM7 == p_inst )
    {
        __HAL_RCC_TIM7_CLK_ENABLE();
    }
#endif

#if defined(TIM8)
    if ( TIM8 == p_inst )
    {
        __HAL_RCC_TIM8_CLK_ENABLE();
    }
#endif

#if defined(TIM15)
    if ( TIM15 == p_inst )
    {
        __HAL_RCC_TIM15_CLK_ENABLE();
    }
#endif

#if defined(TIM16)
    if ( TIM16 == p_inst )
    {
        __HAL_RCC_TIM16_CLK_ENABLE();
    }
#endif

#if defined(TIM17)
    if ( TIM17 == p_inst )
    {
        __HAL_RCC_TIM17_CLK_ENABLE();
    }
#endif
}

////////////////////////////////////////////////////////////////////////////////
/*!
* @brief        Disable Timer clock
*
* @param[in]    p_inst  - Timer instance
* @return       status  - Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
static void timer_disable_clock(const TIM_TypeDef * p_inst)
{
#if defined(TIM1)
    if ( TIM1 == p_inst )
    {
        __HAL_RCC_TIM1_CLK_DISABLE();
    }
#endif

#if defined(TIM2)
    if ( TIM2 == p_inst )
    {
        __HAL_RCC_TIM2_CLK_DISABLE();
    }
#endif

#if defined(TIM3)
    if ( TIM3 == p_inst )
    {
        __HAL_RCC_TIM3_CLK_DISABLE();
    }
#endif

#if defined(TIM4)
    if ( TIM4 == p_inst )
    {
        __HAL_RCC_TIM4_CLK_DISABLE();
    }
#endif

#if defined(TIM5)
    if ( TIM5 == p_inst )
    {
        __HAL_RCC_TIM5_CLK_DISABLE();
    }
#endif

#if defined(TIM6)
    if ( TIM6 == p_inst )
    {
        __HAL_RCC_TIM6_CLK_DISABLE();
    }
#endif

#if defined(TIM7)
    if ( TIM7 == p_inst )
    {
        __HAL_RCC_TIM7_CLK_DISABLE();
    }
#endif

#if defined(TIM8)
    if ( TIM8 == p_inst )
    {
        __HAL_RCC_TIM8_CLK_DISABLE();
    }
#endif

#if defined(TIM15)
    if ( TIM15 == p_inst )
    {
        __HAL_RCC_TIM15_CLK_DISABLE();
    }
#endif

#if defined(TIM16)
    if ( TIM16 == p_inst )
    {
        __HAL_RCC_TIM16_CLK_DISABLE();
    }
#endif

#if defined(TIM17)
    if ( TIM17 == p_inst )
    {
        __HAL_RCC_TIM17_CLK_DISABLE();
    }
#endif
}

#if defined(TIM1) || defined(TIM15)
    ////////////////////////////////////////////////////////////////////////////////
    /*!
    * @brief        TIM1 BRK and TIM15 IRQ
    *
    * @return       void
    */
    ////////////////////////////////////////////////////////////////////////////////
    void TIM1_BRK_TIM15_IRQHandler(void)
    {
        // TODO: Process TIM1 break or TIM15 IRQ
    }
#endif

#if defined(TIM1) || defined(TIM16)
    ////////////////////////////////////////////////////////////////////////////////
    /*!
    * @brief        TIM1 UP and TIM16 IRQ
    *
    * @return       void
    */
    ////////////////////////////////////////////////////////////////////////////////
    void TIM1_UP_TIM16_IRQHandler(void)
    {
        // TODO: Process TIM1 UP or TIM16 IRQ
    }
#endif

#if defined(TIM1) || defined(TIM17)
    ////////////////////////////////////////////////////////////////////////////////
    /*!
    * @brief        TIM1 TRG, COM and TIM17 IRQ
    *
    * @return       void
    */
    ////////////////////////////////////////////////////////////////////////////////
    void TIM1_TRG_COM_TIM17_IRQHandler(void)
    {
        // TODO: Process TIM1 TRG,COM or TIM17 IRQ
    }
#endif

#if defined(TIM1)
    ////////////////////////////////////////////////////////////////////////////////
    /*!
    * @brief        TIM1 CC IRQ
    *
    * @return       void
    */
    ////////////////////////////////////////////////////////////////////////////////
    void TIM1_CC_IRQHandler(void)
    {
        // TODO: Process TIM1 CC IRQ
    }
#endif

