stm32LLD/timer/src/timer.c
    // Timer 1 Channel 2 - Positive PWM
    GPIO_InitStruct.Pin         = TIM1_CH2__PIN;
    GPIO_InitStruct.Mode        = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull        = GPIO_NOPULL;
    GPIO_InitStruct.Speed       = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStruct.Alternate   = TIM1_CH2__AF;
    HAL_GPIO_Init( TIM1_CH2__PORT, &GPIO_InitStruct );

    // Timer 1 Channel 2 - Negative PWM
    GPIO_InitStruct.Pin         = TIM1_CH2N__PIN;
    GPIO_InitStruct.Mode        = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull        = GPIO_NOPULL;
    GPIO_InitStruct.Speed       = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStruct.Alternate   = TIM1_CH2N__AF;
    HAL_GPIO_Init( TIM1_CH2N__PORT, &GPIO_InitStruct );

    // Timer 1 Channel 3 - Positive PWM
    GPIO_InitStruct.Pin         = TIM1_CH3__PIN;
    GPIO_InitStruct.Mode        = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull        = GPIO_NOPULL;
    GPIO_InitStruct.Speed       = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStruct.Alternate   = TIM1_CH3__AF;
    HAL_GPIO_Init( TIM1_CH3__PORT, &GPIO_InitStruct );

    // Timer 1 Channel 3 - Negative PWM
    GPIO_InitStruct.Pin         = TIM1_CH3N__PIN;
    GPIO_InitStruct.Mode        = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull        = GPIO_NOPULL;
    GPIO_InitStruct.Speed       = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStruct.Alternate   = TIM1_CH3N__AF;
    HAL_GPIO_Init( TIM1_CH3N__PORT, &GPIO_InitStruct );
}

////////////////////////////////////////////////////////////////////////////////
/*!
* @brief        Calculate dead time
*
* @param[in]    deadtime_us - Deadtime in us
* @return       deadtime    - Deadtime in raw form for DTG register
*/
////////////////////////////////////////////////////////////////////////////////
static uint32_t timer_1_calc_deadtime(const float32_t deadtime_us)
{
    uint32_t deadtime = 0U;

    if ( deadtime_us <= 1.68f )
    {
        deadtime = (uint32_t) ( deadtime_us / 0.013f ) & 0x7FU;
    }
    else if ( deadtime_us <= 3.40f )
    {
        deadtime = (uint32_t) (( deadtime_us - 1.68f ) / 0.028f ) & 0x3FU;
        deadtime |= 0x80;
    }
    else if ( deadtime_us <= 6.8f )
    {
        deadtime = (uint32_t) ( deadtime_us / 0.104f ) & 0x1FU;
        deadtime |= 0xC0;
    }
    else if ( deadtime_us <= 12.0f )
    {
        deadtime = (uint32_t) ( deadtime_us / 0.208f ) & 0x1FU;
        deadtime |= 0xE0;
    }
    else
    {
        // No actions...
    }

    return deadtime;
}

////////////////////////////////////////////////////////////////////////////////
/*!
* @brief        Limit duty cycle
*
* @param[in]    duty_in     - Inputed duty cycle
* @return       duty_out    - Outputed limited duty cycle
*/
////////////////////////////////////////////////////////////////////////////////
static inline float32_t timer_1_limit_duty(const float32_t duty_in)
{
    float32_t duty_out = 0.0f;

    if ( duty_in > 1.0f )
    {
        duty_out = 1.0f;
    }
    else if ( duty_in < 0.0f )
    {
        duty_out = 0.0f;
    }
    else
    {
        duty_out = duty_in;
    }

    return duty_out;
}

////////////////////////////////////////////////////////////////////////////////
/*!
* @brief        Initialize timer 1 for motor control and ADC triggering
*
* @param[in]    p_cfg       - Timer configurations
* @return       status      - Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
timer_status_t timer_1_init(const timer_1_cfg_t * const p_cfg)
{
    timer_status_t status = eTIMER_OK;

    TIM_ClockConfigTypeDef          sClockSourceConfig      = {0};
    TIM_MasterConfigTypeDef         sMasterConfig           = {0};
    TIM_OC_InitTypeDef              sConfigOC               = {0};
    TIM_BreakDeadTimeConfigTypeDef  sBreakDeadTimeConfig    = {0};

    // Init Timer PWM gpios
    timer_1_init_gpio();

    // Enable timer clock
    __HAL_RCC_TIM1_CLK_ENABLE();

    // Input clock is 150 MHz
    // Frequency times 2 as it is up/down counter
    const uint32_t period = (uint32_t)( 150e6 / ( 2 * p_cfg->freq ));

    gh_tim1.Instance                  = TIM1;
    gh_tim1.Init.Prescaler            = 0;
    gh_tim1.Init.CounterMode          = TIM_COUNTERMODE_CENTERALIGNED1;
    gh_tim1.Init.Period               = period;
    gh_tim1.Init.ClockDivision        = TIM_CLOCKDIVISION_DIV2;
    gh_tim1.Init.RepetitionCounter    = 0;
    gh_tim1.Init.AutoReloadPreload    = TIM_AUTORELOAD_PRELOAD_DISABLE;

    if ( HAL_OK != HAL_TIM_Base_Init( &gh_tim1 ))
    {
        status = eTIMER_ERROR;
    }

    // Set internal clock source
    sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;

    if ( HAL_OK != HAL_TIM_ConfigClockSource( &gh_tim1, &sClockSourceConfig ))
    {
        status = eTIMER_ERROR;
    }


    if ( HAL_OK != HAL_TIM_PWM_Init( &gh_tim1 ))
    {
        status = eTIMER_ERROR;
    }


    // TODO: This is important for ADC triggering
    sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
    sMasterConfig.MasterOutputTrigger2 = TIM_TRGO2_RESET;
    sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
    if (HAL_TIMEx_MasterConfigSynchronization(&gh_tim1, &sMasterConfig) != HAL_OK)
    {
        status = eTIMER_ERROR;
    }

    // Setup channels
    sConfigOC.OCMode        = TIM_OCMODE_PWM1;
    sConfigOC.Pulse         = 0;
    sConfigOC.OCPolarity    = TIM_OCPOLARITY_HIGH;
    sConfigOC.OCNPolarity   = TIM_OCNPOLARITY_HIGH;
    sConfigOC.OCFastMode    = TIM_OCFAST_DISABLE;
    sConfigOC.OCIdleState   = TIM_OCIDLESTATE_RESET;
    sConfigOC.OCNIdleState  = TIM_OCNIDLESTATE_RESET;

    if ( HAL_OK != HAL_TIM_PWM_ConfigChannel( &gh_tim1, &sConfigOC, TIM_CHANNEL_1 ))
    {
        status = eTIMER_ERROR;
    }

    if ( HAL_OK != HAL_TIM_PWM_ConfigChannel( &gh_tim1, &sConfigOC, TIM_CHANNEL_2 ))
    {
        status = eTIMER_ERROR;
    }

    if ( HAL_OK != HAL_TIM_PWM_ConfigChannel( &gh_tim1, &sConfigOC, TIM_CHANNEL_3 ))
    {
      status = eTIMER_ERROR;
    }

    // Setup break & deadtime
    sBreakDeadTimeConfig.OffStateRunMode    = TIM_OSSR_DISABLE;
    sBreakDeadTimeConfig.OffStateIDLEMode   = TIM_OSSI_DISABLE;
    sBreakDeadTimeConfig.LockLevel          = TIM_LOCKLEVEL_OFF;
    sBreakDeadTimeConfig.DeadTime           = timer_1_calc_deadtime( p_cfg->deadtime );
    sBreakDeadTimeConfig.BreakState         = TIM_BREAK_DISABLE;
    sBreakDeadTimeConfig.BreakPolarity      = TIM_BREAKPOLARITY_HIGH;
    sBreakDeadTimeConfig.BreakFilter        = 0;
    sBreakDeadTimeConfig.BreakAFMode        = TIM_BREAK_AFMODE_INPUT;
    sBreakDeadTimeConfig.Break2State        = TIM_BREAK2_DISABLE;
    sBreakDeadTimeConfig.Break2Polarity     = TIM_BREAK2POLARITY_HIGH;
    sBreakDeadTimeConfig.Break2Filter       = 0;
    sBreakDeadTimeConfig.Break2AFMode       = TIM_BREAK_AFMODE_INPUT;
    sBreakDeadTimeConfig.AutomaticOutput    = TIM_AUTOMATICOUTPUT_DISABLE;

    if ( HAL_OK != HAL_TIMEx_ConfigBreakDeadTime( &gh_tim1, &sBreakDeadTimeConfig ))
    {
        status = eTIMER_ERROR;
    }

    // Start timer
    HAL_TIM_Base_Start( &gh_tim1 );
    HAL_TIM_PWM_Start( &gh_tim1, TIM_CHANNEL_1 );
    HAL_TIM_PWM_Start( &gh_tim1, TIM_CHANNEL_2 );
    HAL_TIM_PWM_Start( &gh_tim1, TIM_CHANNEL_3 );
    HAL_TIMEx_PWMN_Start( &gh_tim1, TIM_CHANNEL_1 );
    HAL_TIMEx_PWMN_Start( &gh_tim1, TIM_CHANNEL_2 );
    HAL_TIMEx_PWMN_Start( &gh_tim1, TIM_CHANNEL_3 );

    // Set initial duty
    (void) timer_1_set_pwm( 0.0f, 0.0f, 0.0f );

