stm32LLD/timer/src/timer.c
    return status;
}

////////////////////////////////////////////////////////////////////////////////
/*!
* @brief        Set duty cycle
*
* @param[in]    duty_u      - Duty cycle for phase U. Valid range: 0-1
* @param[in]    duty_v      - Duty cycle for phase V. Valid range: 0-1
* @param[in]    duty_w      - Duty cycle for phase W. Valid range: 0-1
* @return       status      - Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
timer_status_t timer_1_set_pwm(const float32_t duty_u, const float32_t duty_v, const float32_t duty_w)
{
    timer_status_t status = eTIMER_OK;

    TIMER_ASSERT(( duty_u >= 0.0f ) && ( duty_u <= 1.0f ))
    TIMER_ASSERT(( duty_v >= 0.0f ) && ( duty_v <= 1.0f ))
    TIMER_ASSERT(( duty_w >= 0.0f ) && ( duty_w <= 1.0f ))

    // Get period
    const uint32_t period = (uint32_t) __HAL_TIM_GET_AUTORELOAD( &gh_tim1 );

    // Limit duty cycles
    const float32_t duty_u_lim = timer_1_limit_duty( duty_u );
    const float32_t duty_v_lim = timer_1_limit_duty( duty_v );
    const float32_t duty_w_lim = timer_1_limit_duty( duty_w );

    // Calculate compare
    const uint32_t ccr1 = (uint32_t)( duty_u_lim * (float32_t) period );
    const uint32_t ccr2 = (uint32_t)( duty_v_lim * (float32_t) period );
    const uint32_t ccr3 = (uint32_t)( duty_w_lim * (float32_t) period );

    // Set compare
    __HAL_TIM_SET_COMPARE( &gh_tim1, TIM_CHANNEL_1, ccr1 );
    __HAL_TIM_SET_COMPARE( &gh_tim1, TIM_CHANNEL_2, ccr2 );
    __HAL_TIM_SET_COMPARE( &gh_tim1, TIM_CHANNEL_3, ccr3 );

    return status;
}

////////////////////////////////////////////////////////////////////////////////
/**
* @} <!-- END GROUP -->
*/
////////////////////////////////////////////////////////////////////////////////
